package local.home.task01.main;

/*Вычислить значение выражения по формуле (Задача 9 - Линейные программы)
 *(все переменные принимают действительные значения):
 */

public class Task09 {
	public static void main(String[] args) {
		double a = 4;
		double b = 8;
		double c = 2;
		double d = 4;
		
		System.out.println("Значение выражения = ");
		System.out.println((a / c) * (b / d) - (a * b - c) / (c * d));
				
	}

}
