package local.home.task01.main;

// Найдите значение функции: с = 3 + а
public class Task02 {
	public static void main(String[] args) {
		int a = 10;
		int c = 3 + a;
		System.out.println("Значение переменной a = " + a);

		System.out.println("Значение функции =" + ' ' + c);

	}

}
