package local.home.task01.main;

//4. Найдите значение функции: z = ( (a – 3 ) * b / 2) + c.
public class Task04 {
	public static void main(String[] args) {
		int a = 10;
		int b = 20;
		int c = 30;
		int z = ((a - 3) * b / 2) + c;
		System.out.println("Значение переменной a=" + ' ' + a);
		System.out.println("Значение переменной b=" + ' ' + b);
		System.out.println("Значение переменной c=" + ' ' + c);

		System.out.println("Значение функции =" + ' ' + z);
	}

}
