package local.home.task01.main;

/*Даны два действительных числа х и у.
*Вычислить их сумму, разность, произведение и частное.*/

public class Task01 {
	public static void main(String[] args) {
		float x = 14;
		float y = 5;
	
		System.out.println("Значение переменной x =" + ' ' + x);
		System.out.println("Значение переменной y =" + ' ' + y);

		System.out.println("Сумма =" + ' ' + (x + y));
		System.out.println("Разность =" + ' ' + (x - y));
		System.out.println("Произведение =" + ' ' + (x * y));
		System.out.println("Частное =" + ' ' + (x / y));
	}

}
