package local.home.task01.main;

//Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника

public class Task07 {
	public static void main(String[] arvg) {
		int a = 5;

		System.out.println("Ширина прямоугольника = " + a);
		System.out.println("Длина прямоугольника = " + (a * 2));
		System.out.println("Площадь прямоугольника = " + (a * (a * 2)));
	}

}
