package local.home.task01.main;

// Найдите значение функции z= 2 * x + ( y - 2 ) * 5
public class Task03 {
	public static void main(String[] args) {
		int x = 10;
		int y = 20;
		int z = 2 * x + (y - 2) * 5;
		System.out.println("Значение переменной x =" + ' ' + x);
		System.out.println("Значение переменной y =" + ' ' + y);

		System.out.println("Значение функции =" + ' ' + z);
	}

}
